Repository: giellalt/corpus-sme
Catalog: prestable/tmx/sma/admin/depts/udir.no/sfs_veiledning_34_digital-fotofortelli.html.tmx
Source language: sme
Languages: sma

source: Oahppit sáhttet iešguđetlágan prográmmaiguin oalle álkit ráhkadit čáppa digitála ovdanbidjamiid.
sma: Joekehts programmigujmie learohkh maehtieh hijven digitale vuasahtallemh darjodh, aelhkie dïrregigujmie.

source: Bargu heive buot agiide.
sma: Daate barkoe sjeahta gaajhkine jaepiedaltesinie.

source: Dási ja hivvodaga sáhttá heivehit ceahkkái ja ovttaskas oahppái.
sma: Maahta man jïjnjem jïh njieptjiem daltesasse jïh dan aktegs learoehkasse sjïehtedidh.

source: Oahpaheaddji ferte ieš máhttit geavahit dábálaččamus bargovugiid ovdal go bargagoahtá ohppiiguin.
sma: Lohkehtæjja tjuara haalvedh dejtie voemeluktie nåhtadamme funksjovnide aarebi satne barkojne learohkigujmie nearhka.

source: Jus oahppit leat apmasat bargovuohkái, de berrejit álggos ráhkadit ovttas govvamuitalusaža.
sma: Jis learohkh ovnohkens barkoevuekine, dah byøroeh aktem åenehks fotsoptsesem ektesne voestegh darjodh.

source: Oahpaheaddji čájeha, čilge ja bagadallá.
sma: Lohkehtæjja vuesehte, buerkeste jïh bïhkede.

source: Dasto sáhttet oahppit iehčaneaset geahččaladdat.
sma: Dan mænngan learohkh maehtieh oktemierien voejhkelidh.

source: Govvamuitalusaid sáhttá dađistaga ráhkadit guhkkin, máŋggageardánin ja dasa sáhttá bidjat fágalaš sisdoalu.
sma: Fotosoptsesh maehtieh mænngan guhkies jïh geerve sjïdtedh, jïh aktem faageles sisvegem utnedh.

source: Muitte ohppiiguin ságastallat govaid ja gálduid geavaheami birra.
sma: Mujhtieh learohkigujmie soptsestidh guvviereaktaj jïh gaaltijeåtnoen bïjre.

source: Reaiddut - pc mas lea jietnakoarta - mikrofovdna - digitála govvenapparáhtta - govat - prográmma mainna sáhttá ovttastahttit jienaid, govaid, videoid ja teavsttaid. (Dákkár prográmma lea dávjá juo dihtoris, ja gávdnojit maid nuvttáprográmmat.)
sma: programmevaaroe maam maahta nåhtadidh juktie tjoejem, guvvieh, video jïh tjaalegh aktanidh (Akte dagkeres programme lea daamtaj pc ’ ine, jïh namhtah programmh aaj gååvnesieh.)

source: - govvaredigerenprográmma.
sma: guvviestaeriedimmieprogramme.

source: (Jus ii gávdno juo dihtoris govvaredigerenprográmma, de gávdnojit máŋga nuvttáprográmma maid sáhttá dihtorii viežžat.)
sma: (Jis ij leah programmevaaroe bïejesovveme guvviegïetedæmman daatovrisnie, dle jïjnjh namhtah programmh gååvnesieh mejtie maahta våålese leessedh.)

source: Bargovuohki Oahppit čállet teavstta ja ráhkadit dasa govaid, dahje sii čállet teavstta govaide.
sma: Learohkh aktem tjaalegem tjaelieh jïh disse illustrasjovnem bïejieh, jallh dah tjaalegh guvvide tjaelieh.

source: Sii bidjet sisa jienaid, lohket sisa teavstta ja/dahje bidjat dasa musihka.
sma: Dah tjoejem disse bïejieh, tjaalegem luhkieh jïh / jallh musihkem lissiehtieh.

source: Teavsttat sáhttet leat máidnasat, divttat, lávlagat dahje iežaset muitalusat.
sma: Dah tjaalegh maehtieh heamtuvrh, dikth, laavlomh jïh jïjtsh soptsesh årrodh.

source: Govvamuitalusaid sáhttá geavahit dalle go oahppit áigot ovdanbuktit juoidá earáide.
sma: Dah maehtieh faagetjaalegh tjaeledh, faageaamhth øørnedidh jïh vuartasjimmieh jallh barkoevuekiem vihtiestidh.

source: Bargojohtu
sma: Barkoevuekie

source: Oahpaheaddji mearrida, dahje oahppit mearridit govvamuitalusa šáŋŋera ja fáttá.
sma: Lohkehtæjja muana, jallh learohkh sjaangerem jïh aamhtesem veeljieh fotosoptsesasse.

source: Oahppit govvejit, sárgot dahje ohcet govaid interneahtas.
sma: Learohkh guvvieh vaeltieh, guvviedieh jallh guvvieh nedtesne gaevnieh.

source: Oahpaheaddji sáhttá maid addit sidjiide muhtin govaid maid gaskkas válljedit.
sma: Lohkehtæjja maahta badth aaj dejtie naan guvvieh vedtedh, mej gaskem maehtieh veeljedh.

source: Oahppit ráhkadit vuosttaš ja maŋemus siiddu.
sma: Learohkh voestes jïh minngemes sæjroem darjoeh.

source: Dán sáhttá dahkat alcces prográmmii, sárgunprográmmas dahje ovdanbuktinprográmmas.
sma: Dam maahta darjodh jïjtjehke programmesne, akte guvviedimmieprogrammesne jallh aktine åehpiedehtemedïrreginie.

source: Jus geavahit sárgunprográmma dahje ovdanbuktinprográmma, de fertejit vurket fiillaid govvaformáhttii dego jpg dahje jpeg.
sma: Jis guvviedimmieprogrammem jallh åehpiedehtemedïrregem nåhtadieh, tjuerieh fijlide vøørhkedh guvvieformatesne goh jpg jallh jpeg.

source: Ovdasiiddus sáhttá leat omd. girječálli namma.
sma: Åvtesæjrosne edtja vuesiehtimmien gaavhtan tjaalegetjaelijen nomme årrodh.

source: Das sáhttá maid govva mii govvida fáttá dahje buktá beroštumi fáddái.
sma: Daesnie maahta aaj akte guvvie årrodh goh illustrasjovne aamhtesasse, jallh mij iedtjem skreejrie disse.

source: Maŋemus siiddus galgá leat govvamuitalusa ráhkadeaddji namma.
sma: Minngemes sæjrosne edtja tjåadtjodh gieh fotosoptsesem dorjeme.

source: Das galget maid leat gáldočujuhusat.
sma: Desnie edtja aaj tjåadtjodh gusnie gaaltijh gaavneme.

source: Oahppit fertejit muitit sihke musihka, teavstta ja govaid.
sma: Learohkh tjuerieh dovne musihkem, tjaalegh jïh guvvieh mujhtedh.

source: Oahppit čállet dahje bidjet sisa teavsttaid ja bidjet govaid.
sma: Learohkh tjaelieh jallh lïjmesjieh tjaalegem, jïh guvvieh disse bïejieh.

source: Sii lohket teavstta báddái, bidjet jiena ala ja bidjet sisa musihka.
sma: Dah tjaalegem luhkieh, tjoejh lissiehtieh jïh musihkem bïejieh.

source: Govaid heivehit vuohkkasit oktii.
sma: Dah sertiestimmieh darjoeh.

source: Loahpas ráhkadit oahppit waw-fiilla.
sma: Minngemosth learohkh waw-fijlem darjoeh.

source: Oahppit čájehit iežaset govvamuitalusa guhtet guimmiidasaset.
sma: Learohkh fotosoptsesidie sinsætnan vuesiehtieh.

source: Sii sáhttet maid čájehit daid váhnmemiidda geat fitnet luohkás.
sma: Dah maehtieh aaj dejtie vuesiehtidh gosse eejhtegh guessine klaassesne..

source: Oahpaheaddji árvvoštallá gárvves govvamuitalusa.
sma: Lohkehtæjja vuarjesje dam gaervies fotosoptsesem.

source: Jus oahppit geavahit govvámuitalusa oahppamii, de ferte maid fágalaš sisdoallu árvvoštallojuvvot.
sma: Jis learohkh fotosoptsesem lïerehtimmiebarkosne nåhtadieh, maahta aaj dam faageles sisvegem vuarjasjidh.

source: Govvamuitalus sáhttá adnot árvvoštallat oahppi riektačállin- ja sátneriggodat-ovdáneami sámegielfágas.
sma: Akte fotosoptsese maahta aaj våaroeminie årrodh juktie learohken reaktoetjaelemem jïh baakoeveahkam saemienfaagesne vuarjasjidh.

source: Vuollelis lea skovvi man sáhttá atnit dađistaga-árvvoštallamii.
sma: Nuelesne akte goere maam maahta nåhtadidh vuarjasjimmesne iktemearan.

source: Válljejuvvon mihtut galget govvidit barggu ovdáneami.
sma: Dah ulmieh mah leah veeljeme, edtjieh progresjovnem barkosne vuesiehtidh.

source: Dás sáhttá oahpaheaddji čuovvut oahppi ovdáneami.
sma: Daesnie lohkehtæjja maahta learohki evtiedimmiem fulkedh.

source: Oahppit sáhttet maid geavahit skovi go árvvoštallet iežaset ja guhtet guoimmiset.
sma: Learohkh maehtieh goerem nåhtadidh gosse jïjtjemse jallh sinsitniem vuarjasjieh.

source: Árvvoštallan
sma: Vuarjasjimmie

source: Oahppi máhttá
sma: Learohke maahta

source: govvet digitála govvenapparáhtain
sma: guvvieh vaeltedh digitale kaamerinie

source: sirdit govaid govvenapparáhtas dihtorii
sma: datamaskin guvvieh sertedh aktede kaameristie akten daatovrasse

source: gávdnat fas iežas govaid dihtoris
sma: sov guvvieh pc ’ sne gaavnedidh

source: čállit sisa teavsttaid
sma: tjaalegh daatovrisnie tjaeledh

source: báddet jienaid digitála reaidduiguin
sma: tjoejem bæjjese vaeltedh digitale viehkiedïrregigujmie

source: bidjat sisa teavstta ja govaid
sma: tjaalegem jïh guvvieh tsaekedh

source: plánet govvamuitalusa mas leat govat, čállojuvvon teavsttat, jienat ja musihkka
sma: aktem fotosoptsesem soejkesjidh gusnie guvvieh, tjaeleme tjaalegh, tjoeje jïh musihke

source: ráhkadit govvamuitalusa mas leat govat, čállojuvvon teavsttat, jienat ja musihkka, ja bidjat daid vuohkkasit oktii
sma: fotosoptsesem darjodh gusnie guvvieh, tjaeleme tjaalegh, tjoeje jïh musihke, jïh dam tjåanghkan bïejedh guktie hijven sertiestimmieh sjïdtieh

source: dokumenteret fuomášumiid dahje bargoproseassa
sma: vuartasjimmieh jallh aktem barkoevuekiem vihtiestidh

source: ovdanbuktit fágalaš barggu
sma: faageaamhth åehpiedehtedh
